EMACS/org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Org-Mode</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Org-Mode"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-09 04:15:35 PDT"/>
<meta name="author" content="Leslie"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../stylesheets/stylenew.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://lesliezhu.github.com/EMACS/index.html"> UP </a>
 |
 <a accesskey="H" href="http://lesliezhu.github.com"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Org-Mode</h1>






<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 简介</a></li>
<li><a href="#sec-2">2 文档结构</a></li>
<li><a href="#sec-3">3 中文乱码问题</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> 简介</h3>
<div class="outline-text-3" id="text-1">

<p>   自从开始org-mode写文档以来，我就爱上了写文档，这里是对org-mode的info文档翻译，也是一个笔记。
</p></div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> 文档结构</h3>
<div class="outline-text-3" id="text-2">

<p>   org-mode是基于Outline mode的，但提供了一系列方便的命令也进行结构化的文档编辑。
</p>
<p>
   org-mode支持表格、链接、外链接、邮件等;TODO不是org-mode的一个单独部分，而是作为文档的一个小节，因为在文档中常常使用TODO功能。
</p>
<p>
   Tag标签必须是类似 <b>:work:</b> 的形式，一般是前后有相同的符号.
</p>

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> 中文乱码问题</h3>
<div class="outline-text-3" id="text-3">


<p>
   1). 使用org-mode撰写文档，导出HTML格式时，出现中文乱码现象，这是org-html.el文件中默认是iso-8859-1字符集的原因,需要修改为utf-8.
</p>
<p>
   2). 发现该文件是/usr/share/emacs/23.3/lisp/org/org-html.elc，于是下载一个emacs-24.2版本源码进行编译安装.
</p>
<ul>
<li>安装后是/usr/local/bin/emacs, 将源码复制到/usr/share/emacs/emacs-24.2/。<br/>
</li>
<li>修改/usr/share/emacs/emacs-24.2/lisp/org/org-html.el文件，并在~/.bashrc中设置：
</li>
</ul>




<pre class="src src-bash">#!/usr/bin/env bash
alias emacs='/usr/local/bin/emacs -nw'
</pre>





<!-- Duoshuo Comment BEGIN -->
<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"lesliezhu"};
(function() {
var ds = document.createElement('script');
ds.type = 'text/javascript';ds.async = true;
ds.src = 'http://static.duoshuo.com/embed.js';
ds.charset = 'UTF-8';
(document.getElementsByTagName('head')[0] 
        || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
    </script>
<!-- Duoshuo Comment END -->
</div>
</div>
</div>

<div id="postamble">
<p class="date">日期: 2013-06-09 04:15:35 PDT</p>
<p class="author">作者: Leslie</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
